# series

In [1]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a', 'b', 'c']
my_list = [10, 20, 30]
arr = np.array(my_list)
d = {'a': 10, 'b': 20, 'c': 30}

In [4]:
labels

['a', 'b', 'c']

In [5]:
my_list

[10, 20, 30]

In [6]:
arr

array([10, 20, 30])

In [7]:
d

{'a': 10, 'b': 20, 'c': 30}

In [9]:
pd.Series(data = my_list, index = labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(my_list, labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [14]:
pd.Series(data = [sum, len])

0    <built-in function sum>
1    <built-in function len>
dtype: object

In [15]:
ser1 = pd.Series([1, 2, 3, 4], ['USA', 'Germany', 'USSR', 'Japan'])

In [16]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [18]:
ser1.index

Index(['USA', 'Germany', 'USSR', 'Japan'], dtype='object')

In [21]:
ser2 = pd.Series([1, 2, 5, 4], ['USA', 'Germany', 'Italy', 'Japan'])

In [22]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [23]:
ser3 = pd.Series(data = labels)

In [24]:
ser3

0    a
1    b
2    c
dtype: object

In [25]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# dataframe

In [27]:
from numpy.random import randn

In [28]:
np.random.seed(101)

In [35]:
df = pd.DataFrame(randn(5, 4), index = 'A B C D E'.split(), columns='W X Y Z'.split())

In [36]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [37]:
df['W']

A   -1.467514
B    0.392489
C    0.666319
D    0.641806
E   -1.972605
Name: W, dtype: float64

In [39]:
type(df['W'])

pandas.core.series.Series

In [40]:
df['W'].dtype

dtype('float64')

In [41]:
df.W

A   -1.467514
B    0.392489
C    0.666319
D    0.641806
E   -1.972605
Name: W, dtype: float64

In [42]:
df[['W', 'Z']]

          W         Z
A -1.467514  0.485809
B  0.392489  1.541990
C  0.666319  1.407338
D  0.641806  1.028293
E -1.972605 -1.223082

In [43]:
df['New'] = df['W'] + df['Y']

In [44]:
df['New']

A   -1.630049
B   -0.462707
C    0.097738
D    0.250649
E   -1.251818
Name: New, dtype: float64

In [45]:
df

          W         X         Y         Z       New
A -1.467514 -0.494095 -0.162535  0.485809 -1.630049
B  0.392489  0.221491 -0.855196  1.541990 -0.462707
C  0.666319 -0.538235 -0.568581  1.407338  0.097738
D  0.641806 -0.905100 -0.391157  1.028293  0.250649
E -1.972605 -0.866885  0.720788 -1.223082 -1.251818

In [48]:
df.drop('New', axis=1)

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [49]:
df.drop('A')

          W         X         Y         Z       New
B  0.392489  0.221491 -0.855196  1.541990 -0.462707
C  0.666319 -0.538235 -0.568581  1.407338  0.097738
D  0.641806 -0.905100 -0.391157  1.028293  0.250649
E -1.972605 -0.866885  0.720788 -1.223082 -1.251818

In [50]:
df

          W         X         Y         Z       New
A -1.467514 -0.494095 -0.162535  0.485809 -1.630049
B  0.392489  0.221491 -0.855196  1.541990 -0.462707
C  0.666319 -0.538235 -0.568581  1.407338  0.097738
D  0.641806 -0.905100 -0.391157  1.028293  0.250649
E -1.972605 -0.866885  0.720788 -1.223082 -1.251818

In [52]:
df.drop('New', axis=1, inplace=True)

In [53]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [56]:
df.drop('E', inplace=True)

In [57]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293

In [58]:
df.shape

(4, 4)

In [60]:
df.loc['A']

W   -1.467514
X   -0.494095
Y   -0.162535
Z    0.485809
Name: A, dtype: float64

In [65]:
df.iloc[0]

W   -1.467514
X   -0.494095
Y   -0.162535
Z    0.485809
Name: A, dtype: float64

In [67]:
df.loc['A', 'Y']

-0.1625347347726149

In [70]:
df.loc[['A', 'C'], ['W', 'Y']]

          W         Y
A -1.467514 -0.162535
C  0.666319 -0.568581

In [71]:
df = pd.DataFrame(randn(5, 4), index = 'A B C D E'.split(), columns='W X Y Z'.split())

In [72]:
df

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [73]:
df > 0

       W      X      Y      Z
A   True  False  False  False
B   True  False  False   True
C  False   True   True   True
D  False   True   True   True
E   True  False   True  False

In [75]:
bool_df = df > 0

In [76]:
bool_df

       W      X      Y      Z
A   True  False  False  False
B   True  False  False   True
C  False   True   True   True
D  False   True   True   True
E   True  False   True  False

In [77]:
df[bool_df]

         W         X         Y         Z
A  1.60678       NaN       NaN       NaN
B  0.04146       NaN       NaN  0.110477
C      NaN  0.253548  0.649148  0.358941
D      NaN  0.902398  0.161781  0.833029
E  0.97572       NaN  0.783316       NaN

In [79]:
df[df > 0]

         W         X         Y         Z
A  1.60678       NaN       NaN       NaN
B  0.04146       NaN       NaN  0.110477
C      NaN  0.253548  0.649148  0.358941
D      NaN  0.902398  0.161781  0.833029
E  0.97572       NaN  0.783316       NaN

In [81]:
df['W'] > 0

A     True
B     True
C    False
D    False
E     True
Name: W, dtype: bool

In [93]:
df[df['W'] > 0]

         W         X         Y         Z
A  1.60678 -1.115710 -1.385379 -1.329660
B  0.04146 -0.411055 -0.771329  0.110477
E  0.97572 -0.388239  0.783316 -0.708954

In [98]:
df[df['Z'] > 0]

          W         X         Y         Z
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029

In [99]:
result_df = df[df['Z'] > 0]

In [100]:
result_df

          W         X         Y         Z
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029

In [101]:
result_df['X']

B   -0.411055
C    0.253548
D    0.902398
Name: X, dtype: float64

In [102]:
df[df['Z'] > 0]['X']

B   -0.411055
C    0.253548
D    0.902398
Name: X, dtype: float64

In [104]:
df[df['Z'] > 0]

          W         X         Y         Z
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029

In [105]:
df[df['Y'] > 0]

          W         X         Y         Z
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [113]:
df[(df['Z'] > 0) & (df['Y'] > 0)]

          W         X         Y         Z
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [114]:
df[(df['Z'] > 0) | (df['Y'] > 0)]

          W         X         Y         Z
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [115]:
df

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [121]:
df.reset_index(inplace = True)

In [123]:
df

  index         W         X         Y         Z
0     A  1.606780 -1.115710 -1.385379 -1.329660
1     B  0.041460 -0.411055 -0.771329  0.110477
2     C -0.804652  0.253548  0.649148  0.358941
3     D -1.080471  0.902398  0.161781  0.833029
4     E  0.975720 -0.388239  0.783316 -0.708954

In [124]:
df.shape

(5, 5)

In [134]:
new_index = 'CA NY WY OR CO'.split()

In [135]:
new_index

['CA', 'NY', 'WY', 'OR', 'CO']

In [136]:
df['States'] = new_index

In [137]:
df

  index         W         X         Y         Z States
0     A  1.606780 -1.115710 -1.385379 -1.329660     CA
1     B  0.041460 -0.411055 -0.771329  0.110477     NY
2     C -0.804652  0.253548  0.649148  0.358941     WY
3     D -1.080471  0.902398  0.161781  0.833029     OR
4     E  0.975720 -0.388239  0.783316 -0.708954     CO

In [139]:
df.set_index('States', inplace=True)

In [140]:
df

       index         W         X         Y         Z
States
CA         A  1.606780 -1.115710 -1.385379 -1.329660
NY         B  0.041460 -0.411055 -0.771329  0.110477
WY         C -0.804652  0.253548  0.649148  0.358941
OR         D -1.080471  0.902398  0.161781  0.833029
CO         E  0.975720 -0.388239  0.783316 -0.708954

In [148]:
df

       index         W         X         Y         Z
States
CA         A  1.606780 -1.115710 -1.385379 -1.329660
NY         B  0.041460 -0.411055 -0.771329  0.110477
WY         C -0.804652  0.253548  0.649148  0.358941
OR         D -1.080471  0.902398  0.161781  0.833029
CO         E  0.975720 -0.388239  0.783316 -0.708954

# multi-index and index hierarchy

In [155]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [158]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [159]:
np.random.seed(101)

In [166]:
df = pd.DataFrame(np.random.randn(6, 2), index=hier_index, columns='A B'.split())

In [167]:
df

             A         B
G1 1  0.558769  1.024810
   2 -0.925874  1.862864
   3 -1.133817  0.610478
G2 1  0.386030  2.084019
   2 -0.376519  0.230336
   3  0.681209  1.035125

array([[ 0.18869531, -0.75887206],
       [-0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732],
       [ 2.60596728,  0.68350889],
       [ 0.30266545,  1.69372293],
       [-1.70608593, -1.15911942]])

In [168]:
df.loc['G1']

          A         B
1  0.558769  1.024810
2 -0.925874  1.862864
3 -1.133817  0.610478

In [169]:
df.loc['G1'].loc[1]

A    0.558769
B    1.024810
Name: 1, dtype: float64

In [171]:
df.index.names = 'Group Num'.split()

In [172]:
df

                  A         B
Group Num
G1    1    0.558769  1.024810
      2   -0.925874  1.862864
      3   -1.133817  0.610478
G2    1    0.386030  2.084019
      2   -0.376519  0.230336
      3    0.681209  1.035125

In [174]:
df.loc['G2'].loc[2]['B']

0.23033634359240704

In [175]:
df.loc['G2'].loc[2].loc['B']

0.23033634359240704

In [176]:
df.loc['G1']

            A         B
Num
1    0.558769  1.024810
2   -0.925874  1.862864
3   -1.133817  0.610478

In [177]:
df.xs('G1')

            A         B
Num
1    0.558769  1.024810
2   -0.925874  1.862864
3   -1.133817  0.610478

In [186]:
df.xs('G1', level='Group')

            A         B
Num
1    0.558769  1.024810
2   -0.925874  1.862864
3   -1.133817  0.610478

In [187]:
df.xs(1, level='Num')

              A         B
Group
G1     0.558769  1.024810
G2     0.386030  2.084019